working-project-animation/OpenFoam/0/alpha.water.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    Inlet
    {
        type            fixedValue;
        value	    uniform 0;
    }
    Outlet
    {
        type            zeroGradient;

    }
    Walls
    {
        type            zeroGradient;
    }
    FrontAndBack
    {
        type            empty;
    }


}

// ************************************************************************* //
